Repository: ntgptit/learnwise
Catalog: lib/l10n/app_*.arb
Languages: vi

# dashboardTitle
source: LearnWise Dashboard
vi: Bảng điều khiển LearnWise

# dashboardLoadingLabel
source: Loading dashboard...
vi: Đang tải bảng điều khiển...

# dashboardErrorTitle
source: Unable to load dashboard
vi: Không thể tải bảng điều khiển

# dashboardErrorDescription
source: Please pull to refresh or try again.
vi: Vui lòng kéo để tải lại hoặc thử lại.

# dashboardRetryLabel
source: Try again
vi: Thử lại

# dashboardGreeting
source: Hello, {name}
vi: Xin chào, {name}

# dashboardHeroHeadline
source: Build your daily learning rhythm
vi: Xây dựng nhịp học tập mỗi ngày

# dashboardStreakLabel
source: Streak
vi: Chuỗi ngày học

# dashboardStreakValue
source: {days} days
vi: {days} ngày

# dashboardGoalProgressLabel
source: Today focus
vi: Mục tiêu hôm nay

# dashboardFocusCountLabel
source: {count} cards
vi: {count} thẻ

# dashboardOverviewTitle
source: Overview
vi: Tổng quan

# dashboardMetricStudyMinutesLabel
source: Study time
vi: Thời gian học

# dashboardMetricWordsMasteredLabel
source: Words mastered
vi: Từ đã nhớ

# dashboardMetricWeeklyGoalLabel
source: Weekly goal
vi: Mục tiêu tuần

# dashboardMetricMinutesValue
source: {minutes} min
vi: {minutes} phút

# dashboardMetricWordsValue
source: {words} words
vi: {words} từ

# dashboardMetricGoalValue
source: {done}/{target} sessions
vi: {done}/{target} buổi

# dashboardQuickActionsTitle
source: Quick actions
vi: Thao tác nhanh

# dashboardActionLearning
source: Start learning
vi: Bắt đầu học

# dashboardActionProgress
source: Open progress
vi: Mở tiến độ

# dashboardActionTts
source: Open TTS lab
vi: Mở phòng TTS

# dashboardTodayFocusTitle
source: Today focus
vi: Trọng tâm hôm nay

# dashboardRecentTitle
source: Recent activity
vi: Hoạt động gần đây

# dashboardRecentStudyCompleted
source: Completed a focused study block
vi: Đã hoàn thành một khối học tập trung

# dashboardRecentProgressUpdated
source: Updated weekly progress plan
vi: Đã cập nhật kế hoạch tiến độ tuần

# dashboardRecentTtsPracticed
source: Practiced pronunciation with TTS
vi: Đã luyện phát âm bằng TTS

# dashboardNavHome
source: Dashboard
vi: Bảng điều khiển

# dashboardNavFolders
source: Folders
vi: Thư mục

# foldersTitle
source: Folder Manager
vi: Quản lý thư mục

# foldersRefreshTooltip
source: Refresh folders
vi: Tải lại danh sách thư mục

# foldersLoadingLabel
source: Loading folders...
vi: Đang tải danh sách thư mục...

# foldersErrorTitle
source: Unable to load folders
vi: Không thể tải danh sách thư mục

# foldersErrorDescription
source: Please refresh and try again.
vi: Vui lòng tải lại và thử lại.

# foldersRetryLabel
source: Retry
vi: Thử lại

# foldersHeroTitle
source: Organize your learning folders
vi: Tổ chức thư mục học tập của bạn

# foldersHeroDescription
source: Create, update, and manage focused collections for your study goals.
vi: Tạo, cập nhật và quản lý bộ thư mục tập trung theo mục tiêu học tập.

# foldersCreateButton
source: New folder
vi: Tạo thư mục

# foldersEmptyTitle
source: No folders yet
vi: Chưa có thư mục nào

# foldersEmptyDescription
source: Create your first folder to structure topics and cards.
vi: Hãy tạo thư mục đầu tiên để sắp xếp chủ đề và thẻ.

# foldersSearchEmptyTitle
source: No folders match your search
vi: Không có thư mục trùng khớp với tìm kiếm

# foldersSearchEmptyDescription
source: Try another keyword or clear the search filter.
vi: Thử từ khóa khác hoặc xóa bộ lọc tìm kiếm.

# foldersCreateBlockedByDecks
source: This folder already has decks. You cannot create subfolders here.
vi: Thư mục này đã có bộ thẻ. Bạn không thể tạo thư mục con tại đây.

# foldersCreateBlockedByFlashcards
source: This folder already has flashcards. You cannot create subfolders here.
vi: Thư mục này đã có flashcard. Bạn không thể tạo thư mục con tại đây.

# foldersCreateDialogTitle
source: Create folder
vi: Tạo thư mục

# foldersEditDialogTitle
source: Edit folder
vi: Cập nhật thư mục

# foldersNameLabel
source: Folder name
vi: Tên thư mục

# foldersNameHint
source: Example: TOEIC Week 1
vi: Ví dụ: TOEIC tuần 1

# foldersNameRequiredValidation
source: Folder name is required.
vi: Tên thư mục là bắt buộc.

# foldersNameMinLengthValidation
source: Folder name must be at least {min} characters.
vi: Tên thư mục phải có ít nhất {min} ký tự.

# foldersNameMaxLengthValidation
source: Folder name must be at most {max} characters.
vi: Tên thư mục tối đa {max} ký tự.

# foldersDescriptionLabel
source: Description
vi: Mô tả

# foldersDescriptionHint
source: Describe this folder focus
vi: Mô tả trọng tâm của thư mục

# foldersDescriptionMaxLengthValidation
source: Description must be at most {max} characters.
vi: Mô tả tối đa {max} ký tự.

# foldersColorLabel
source: Folder color
vi: Màu thư mục

# foldersSearchHint
source: Search folders by name or description
vi: Tìm thư mục theo tên hoặc mô tả

# decksSearchHint
source: Search decks by name
vi: Tìm deck theo tên

# foldersSortByLabel
source: Sort by
vi: Sắp xếp theo

# foldersSortByUpdatedAt
source: Last updated
vi: Cập nhật gần nhất

# foldersSortByCreatedAt
source: Created time
vi: Thời điểm tạo

# foldersSortByName
source: Folder name
vi: Tên thư mục

# foldersSortByFlashcardCount
source: Flashcard count
vi: Số lượng flashcard

# foldersSortDirectionDesc
source: Descending
vi: Giảm dần

# foldersSortDirectionAsc
source: Ascending
vi: Tăng dần

# foldersViewActiveLabel
source: Active
vi: Đang dùng

# foldersViewTrashLabel
source: Trash
vi: Thùng rác

# foldersPagingLabel
source: Page {page}/{totalPages} · {totalItems} folders
vi: Trang {page}/{totalPages} · {totalItems} thư mục

# foldersPreviousPageTooltip
source: Previous page
vi: Trang trước

# foldersNextPageTooltip
source: Next page
vi: Trang sau

# foldersAuditLabel
source: Updated by: {actor}
vi: Cập nhật bởi: {actor}

# foldersCancelLabel
source: Cancel
vi: Hủy

# foldersSaveLabel
source: Save
vi: Lưu

# foldersUpdateLabel
source: Update
vi: Cập nhật

# foldersDeleteDialogTitle
source: Delete folder
vi: Xóa thư mục

# foldersDeleteDialogMessage
source: Delete "{folderName}"? This action cannot be undone.
vi: Xóa "{folderName}"? Hành động này không thể hoàn tác.

# foldersDeleteConfirmLabel
source: Delete
vi: Xóa

# foldersNoDescriptionLabel
source: No description provided.
vi: Chưa có mô tả.

# foldersColorCodeLabel
source: Color: {colorHex}
vi: Màu: {colorHex}

# foldersFlashcardCountLabel
source: {count} flashcards
vi: {count} flashcard

# foldersDeckCountLabel
source: {count} decks
vi: {count} bộ thẻ

# foldersSubfolderCountLabel
source: {count} subfolders
vi: {count} thư mục con

# foldersEditTooltip
source: Edit folder
vi: Sửa thư mục

# foldersOpenTooltip
source: Open folder
vi: Mở thư mục

# foldersBackToParentTooltip
source: Back to parent folder
vi: Quay lại thư mục cha

# foldersRootLabel
source: Root
vi: Gốc

# foldersDeleteTooltip
source: Delete folder
vi: Xóa thư mục

# foldersRestoreTooltip
source: Restore folder
vi: Khôi phục thư mục

# foldersRestoreDialogTitle
source: Restore folder
vi: Khôi phục thư mục

# foldersRestoreDialogMessage
source: Restore "{folderName}" to active folders?
vi: Khôi phục "{folderName}" về danh sách đang dùng?

# foldersRestoreConfirmLabel
source: Restore
vi: Khôi phục

# foldersTrashEmptyTitle
source: Trash is empty
vi: Thùng rác đang trống

# foldersTrashEmptyDescription
source: Deleted folders will appear here.
vi: Thư mục đã xóa sẽ hiển thị tại đây.

# decksSectionTitle
source: Decks
vi: Bộ thẻ

# decksEmptyTitle
source: No decks yet
vi: Chưa có bộ thẻ nào

# decksEmptyDescription
source: Create a deck to keep flashcards for this folder.
vi: Tạo bộ thẻ để lưu flashcard cho thư mục này.

# decksCreateBlockedBySubfolders
source: This folder has subfolders. Remove subfolders before creating decks here.
vi: Thư mục này đang có thư mục con. Hãy xóa thư mục con trước khi tạo bộ thẻ tại đây.

# decksSearchEmptyTitle
source: No decks match your search
vi: Không có bộ thẻ trùng khớp với tìm kiếm

# decksSearchEmptyDescription
source: Try a different term or clear the search filter.
vi: Thử tên khác hoặc xóa bộ lọc tìm kiếm.

# decksCreateButton
source: New deck
vi: Tạo bộ thẻ

# decksLoadingLabel
source: Loading decks...
vi: Đang tải bộ thẻ...

# decksErrorTitle
source: Unable to load decks
vi: Không thể tải danh sách bộ thẻ

# decksErrorDescription
source: Please refresh and try again.
vi: Vui lòng tải lại và thử lại.

# decksRetryLabel
source: Retry
vi: Thử lại

# decksCreateDialogTitle
source: Create deck
vi: Tạo bộ thẻ

# decksEditDialogTitle
source: Edit deck
vi: Cập nhật bộ thẻ

# decksNameLabel
source: Deck name
vi: Tên bộ thẻ

# decksNameHint
source: Example: TOEIC Part 5
vi: Ví dụ: TOEIC Part 5

# decksNameRequiredValidation
source: Deck name is required.
vi: Tên bộ thẻ là bắt buộc.

# decksNameMinLengthValidation
source: Deck name must be at least {min} characters.
vi: Tên bộ thẻ phải có ít nhất {min} ký tự.

# decksNameMaxLengthValidation
source: Deck name must be at most {max} characters.
vi: Tên bộ thẻ tối đa {max} ký tự.

# decksDescriptionLabel
source: Description
vi: Mô tả

# decksDescriptionHint
source: Describe this deck focus
vi: Mô tả trọng tâm của bộ thẻ

# decksDescriptionMaxLengthValidation
source: Description must be at most {max} characters.
vi: Mô tả tối đa {max} ký tự.

# decksCancelLabel
source: Cancel
vi: Hủy

# decksSaveLabel
source: Save
vi: Lưu

# decksUpdateLabel
source: Update
vi: Cập nhật

# decksDeleteDialogTitle
source: Delete deck
vi: Xóa bộ thẻ

# decksDeleteDialogMessage
source: Delete "{deckName}"? This action cannot be undone.
vi: Xóa "{deckName}"? Hành động này không thể hoàn tác.

# decksDeleteConfirmLabel
source: Delete
vi: Xóa

# decksNoDescriptionLabel
source: No description provided.
vi: Chưa có mô tả.

# decksFlashcardCountLabel
source: {count} flashcards
vi: {count} flashcard

# decksEditTooltip
source: Edit deck
vi: Sửa bộ thẻ

# decksOpenTooltip
source: Open deck
vi: Mở bộ thẻ

# decksDeleteTooltip
source: Delete deck
vi: Xóa bộ thẻ

# flashcardsTitle
source: Flashcards
vi: Flashcard

# flashcardsManageTitle
source: Flashcards · {folderName}
vi: Flashcard · {folderName}

# flashcardsTotalLabel
source: {count} flashcards in this deck
vi: {count} flashcard trong bộ thẻ này

# flashcardsFeatureDescription
source: Manage flashcards in this folder from this screen.
vi: Bạn có thể quản lý danh sách flashcard của thư mục tại đây.

# flashcardsLoadingLabel
source: Loading flashcards...
vi: Đang tải danh sách flashcard...

# flashcardsErrorTitle
source: Unable to load flashcards
vi: Không thể tải danh sách flashcard

# flashcardsErrorDescription
source: Please check your connection and try again.
vi: Vui lòng kiểm tra kết nối và thử lại.

# flashcardsRetryLabel
source: Retry
vi: Thử lại

# flashcardsCreateButton
source: Create flashcard
vi: Tạo flashcard

# flashcardsSearchHint
source: Search flashcards
vi: Tìm flashcard

# flashcardsRefreshTooltip
source: Refresh
vi: Tải lại

# flashcardsSortByCreatedAt
source: Created time
vi: Thời điểm tạo

# flashcardsSortByUpdatedAt
source: Updated time
vi: Thời điểm cập nhật

# flashcardsSortByFrontText
source: Front text
vi: Mặt trước

# flashcardsSortDirectionDesc
source: Newest first
vi: Mới nhất trước

# flashcardsSortDirectionAsc
source: Oldest first
vi: Cũ nhất trước

# flashcardsSortDirectionZa
source: Z to A
vi: Z đến A

# flashcardsSortDirectionAz
source: A to Z
vi: A đến Z

# flashcardsEmptyTitle
source: No flashcards yet
vi: Chưa có flashcard

# flashcardsEmptyDescription
source: Create your first flashcard in this folder.
vi: Hãy tạo flashcard đầu tiên trong thư mục này.

# flashcardsCreateDialogTitle
source: Create flashcard
vi: Tạo flashcard

# flashcardsEditDialogTitle
source: Edit flashcard
vi: Cập nhật flashcard

# flashcardsFrontLabel
source: Front
vi: Mặt trước

# flashcardsFrontHint
source: Example: What is JVM?
vi: Ví dụ: JVM là gì?

# flashcardsBackLabel
source: Back
vi: Mặt sau

# flashcardsBackHint
source: Example: Java Virtual Machine
vi: Ví dụ: Java Virtual Machine

# flashcardsFrontRequiredValidation
source: Front text is required.
vi: Nội dung mặt trước là bắt buộc.

# flashcardsFrontMaxLengthValidation
source: Front text must be {max} characters or fewer.
vi: Nội dung mặt trước tối đa {max} ký tự.

# flashcardsBackRequiredValidation
source: Back text is required.
vi: Nội dung mặt sau là bắt buộc.

# flashcardsBackMaxLengthValidation
source: Back text must be {max} characters or fewer.
vi: Nội dung mặt sau tối đa {max} ký tự.

# flashcardsSaveLabel
source: Save
vi: Lưu

# flashcardsUpdateLabel
source: Update
vi: Cập nhật

# flashcardsCancelLabel
source: Cancel
vi: Hủy

# flashcardsEditTooltip
source: Edit
vi: Sửa

# flashcardsDeleteTooltip
source: Delete
vi: Xóa

# flashcardsDeleteDialogTitle
source: Delete flashcard
vi: Xóa flashcard

# flashcardsDeleteDialogMessage
source: Are you sure you want to delete "{frontText}"?
vi: Bạn có chắc muốn xóa "{frontText}" không?

# flashcardsDeleteConfirmLabel
source: Delete
vi: Xóa

# flashcardsOwnerFallback
source: Unknown owner
vi: Chưa rõ người tạo

# flashcardsUpdatedRecentlyLabel
source: Updated recently
vi: Cập nhật gần đây

# flashcardsPreviewPlaceholder
source: No preview card yet
vi: Chưa có thẻ để xem trước

# flashcardsExpandPreviewTooltip
source: Expand preview
vi: Mở rộng xem trước

# flashcardsExpandPreviewToast
source: Preview mode is not available yet.
vi: Chế độ xem trước nâng cao chưa sẵn sàng.

# flashcardsBannerPlaceholder
source: Recommended learning banner
vi: Khu vực banner học tập

# flashcardsBannerInfoTooltip
source: Banner info
vi: Thông tin banner

# flashcardsBannerInfoToast
source: Banner action is not available yet.
vi: Tác vụ banner chưa sẵn sàng.

# flashcardsCardSectionTitle
source: View cards
vi: Card 보기

# flashcardsSortHintToast
source: Sorting option updated.
vi: Đã cập nhật cách sắp xếp.

# flashcardsShowSearchAction
source: Show search
vi: Hiện ô tìm kiếm

# flashcardsHideSearchAction
source: Hide search
vi: Ẩn ô tìm kiếm

# flashcardsBookmarkSetTooltip
source: Bookmark this set
vi: Đánh dấu bộ thẻ

# flashcardsBookmarkSetToast
source: Set bookmark is not available yet.
vi: Chức năng đánh dấu bộ thẻ chưa sẵn sàng.

# flashcardsMoreActionsTooltip
source: More actions
vi: Thao tác khác

# flashcardsCreatePlaceholderToast
source: Create flashcard flow is not available yet.
vi: Luồng tạo flashcard chưa sẵn sàng.

# flashcardsStudySetButton
source: Study this set
vi: Học bộ thẻ này

# flashcardsStudySetToast
source: Study mode is not available yet.
vi: Chế độ học bộ thẻ chưa sẵn sàng.

# flashcardsActionFlipcard
source: Flip cards
vi: Lật thẻ

# flashcardsActionLearn
source: Learn
vi: Học

# flashcardsActionTest
source: Test
vi: Kiểm tra

# flashcardsActionMatch
source: Match cards
vi: Ghép thẻ

# flashcardsStudyModePickerTitle
source: Choose study mode
vi: Chọn chế độ học

# flashcardsStudyModeReview
source: Review
vi: Xem lại

# flashcardsStudyModeMatch
source: Match
vi: Ghép đôi

# flashcardsStudyModeGuess
source: Guess
vi: Đoán

# flashcardsStudyModeRecall
source: Recall
vi: Nhớ lại

# flashcardsStudyModeFill
source: Fill in
vi: Điền (Tự luận)

# flashcardsStudyCompletedTitle
source: Session completed
vi: Hoàn thành phiên học

# flashcardsStudyCompletedSummary
source: Correct: {correctCount} • Wrong: {wrongCount}
vi: Đúng: {correctCount} • Sai: {wrongCount}

# flashcardsStudyRestartLabel
source: Restart
vi: Học lại

# flashcardsStudyRecallMissedLabel
source: Not yet
vi: Chưa nhớ

# flashcardsStudyRecallRememberedLabel
source: Remembered
vi: Đã nhớ

# flashcardsStudyFillInputLabel
source: Your answer
vi: Câu trả lời

# flashcardsStudyFillInputHint
source: Type your answer
vi: Nhập đáp án của bạn

# flashcardsStudySubmitLabel
source: Submit
vi: Trả lời

# flashcardsStudyMatchPrompt
source: Match the pairs
vi: Ghép cặp đúng

# flashcardsStudyMatchLeftColumnLabel
source: Prompt
vi: Từ

# flashcardsStudyMatchRightColumnLabel
source: Answer
vi: Nghĩa

# flashcardsActionFlipcardToast
source: Flip-card mode is not available yet.
vi: Chế độ lật thẻ chưa sẵn sàng.

# flashcardsActionLearnToast
source: Learn mode is not available yet.
vi: Chế độ học chưa sẵn sàng.

# flashcardsActionTestToast
source: Test mode is not available yet.
vi: Chế độ kiểm tra chưa sẵn sàng.

# flashcardsActionMatchToast
source: Match mode is not available yet.
vi: Chế độ ghép thẻ chưa sẵn sàng.

# flashcardsActionBlastToast
source: Blast mode is not available yet.
vi: Chế độ Blast chưa sẵn sàng.

# flashcardsActionBlocksToast
source: Blocks mode is not available yet.
vi: Chế độ Blocks chưa sẵn sàng.

# flashcardsPlayAudioTooltip
source: Play pronunciation
vi: Phát phát âm

# flashcardsBookmarkTooltip
source: Bookmark card
vi: Đánh dấu thẻ

# flashcardsAudioPlayToast
source: Play audio for "{frontText}" is not available yet.
vi: Phát âm cho "{frontText}" chưa sẵn sàng.

# flashcardsBookmarkToast
source: Card bookmarked.
vi: Đã đánh dấu thẻ.

# flashcardsUnbookmarkToast
source: Card bookmark removed.
vi: Đã bỏ đánh dấu thẻ.

# flashcardsCloseTooltip
source: Close
vi: Đóng

# flashcardsBackTooltip
source: Back
vi: Quay lại

# flashcardsStudyTextScaleTooltip
source: Text size
vi: Cỡ chữ

# flashcardsStudyTextScaleToast
source: Text size settings are not available yet.
vi: Tuỳ chỉnh cỡ chữ chưa sẵn sàng.

# flashcardsPreviousTooltip
source: Previous card
vi: Thẻ trước

# flashcardsNextTooltip
source: Next card
vi: Thẻ tiếp theo

# flashcardsFlipStudySettingsTooltip
source: Study settings
vi: Cài đặt học

# flashcardsFlipStudySettingsToast
source: Study settings are not available yet.
vi: Cài đặt học chưa sẵn sàng.

# flashcardsFlipStudyCompletedToast
source: You have reached the last card.
vi: Bạn đã đến thẻ cuối cùng.

# homeTitle
source: LearnWise - Text To Speech
vi: LearnWise - Chuyển văn bản thành giọng nói

# inputSectionTitle
source: Enter text to read:
vi: Nhập nội dung cần đọc:

# languageLabel
source: Language
vi: Ngôn ngữ

# languageAuto
source: Auto (EN/KO)
vi: Tự động (EN/KO)

# koreanVoicesSectionTitle
source: Korean voice list:
vi: Danh sách giọng đọc tiếng Hàn:

source: Loading voices...
vi: Đang tải danh sách giọng...

source: Load Korean voices
vi: Lấy danh sách giọng Hàn

# koreanVoicesCount
source: Total Korean voices found: {count}
vi: Tổng số giọng Hàn tìm thấy: {count}

# selectKoreanVoiceLabel
source: Select Korean voice
vi: Chọn giọng đọc Hàn

# systemDefaultVoice
source: System default
vi: Mặc định hệ thống

# koreanVoiceAlias
source: Korean Voice {index}
vi: Giọng Hàn {index}

# sampleSectionTitle
source: Quick samples:
vi: Mẫu test hardcode:

# voiceSettingsSectionTitle
source: Voice settings:
vi: Điều chỉnh giọng đọc:

# speedLabel
source: Speed
vi: Tốc độ

# pitchLabel
source: Pitch
vi: Cao độ

# volumeLabel
source: Volume
vi: Âm lượng

# inputHint
source: Example: What do you want to learn today?
vi: Ví dụ: Hôm nay bạn muốn học gì?

# readButton
source: Read
vi: Đọc

# stopButton
source: Stop
vi: Dừng

# snackInitFailed
source: Failed to initialize TTS. Please try again.
vi: Khởi tạo TTS thất bại. Vui lòng thử lại.

# snackLoadVoicesFailed
source: Unable to load voice list.
vi: Không tải được danh sách giọng đọc.

# snackReadFailed
source: Failed to read text.
vi: Đọc văn bản thất bại.

# snackStopFailed
source: Failed to stop reading.
vi: Dừng đọc thất bại.

# snackBadRequest
source: Request is invalid. Please check your input.
vi: Yêu cầu không hợp lệ. Vui lòng kiểm tra dữ liệu.

# snackUnauthorized
source: Your session has expired. Please sign in again.
vi: Phiên đăng nhập hết hạn. Vui lòng đăng nhập lại.

# snackForbidden
source: You do not have permission for this action.
vi: Bạn không có quyền thực hiện thao tác này.

# snackNotFound
source: The requested resource was not found.
vi: Không tìm thấy dữ liệu được yêu cầu.

# snackConflict
source: The resource was changed. Please refresh and try again.
vi: Dữ liệu đã thay đổi. Vui lòng tải lại và thử lại.

# snackUnprocessableEntity
source: Submitted data is invalid.
vi: Dữ liệu gửi lên không hợp lệ.

# snackTooManyRequests
source: Too many requests. Please try again shortly.
vi: Quá nhiều yêu cầu. Vui lòng thử lại sau ít phút.

# snackServerError
source: Server error. Please try again later.
vi: Máy chủ đang gặp lỗi. Vui lòng thử lại sau.

# snackNetworkUnavailable
source: No network connection.
vi: Không có kết nối mạng.

# snackTimeout
source: Request timed out. Please retry.
vi: Hết thời gian chờ phản hồi. Vui lòng thử lại.

# snackUnexpectedResponse
source: Received unexpected response from server.
vi: Phản hồi từ máy chủ không đúng định dạng.

# snackDashboardLoadFailed
source: Unable to load dashboard data.
vi: Không thể tải dữ liệu bảng điều khiển.

# snackFolderLoadFailed
source: Unable to load folders.
vi: Không thể tải danh sách thư mục.

# snackFolderCreateFailed
source: Unable to create folder.
vi: Không thể tạo thư mục.

# snackFolderUpdateFailed
source: Unable to update folder.
vi: Không thể cập nhật thư mục.

# snackFolderDeleteFailed
source: Unable to delete folder.
vi: Không thể xóa thư mục.

# snackFolderRestoreFailed
source: Unable to restore folder.
vi: Không thể khôi phục thư mục.

# snackFlashcardLoadFailed
source: Unable to load flashcards.
vi: Không thể tải danh sách flashcard.

# snackFlashcardCreateFailed
source: Unable to create flashcard.
vi: Không thể tạo flashcard.

# snackFlashcardUpdateFailed
source: Unable to update flashcard.
vi: Không thể cập nhật flashcard.

# snackFlashcardDeleteFailed
source: Unable to delete flashcard.
vi: Không thể xóa flashcard.

# snackUnknownError
source: Something went wrong. Please try again.
vi: Đã có lỗi xảy ra. Vui lòng thử lại.
